## helper functions here 

import time
import binascii,hmac,hashlib,secrets,requests,json
import environ
env = environ.Env()
environ.Env.read_env()


def GenerateTranzilaHeaders(PublicKey, PrivateKey):
    Timestamp = int(time.time())
    Nonce = str(binascii.hexlify(secrets.token_bytes(40)), "utf-8")
    AccessKey = hmac.new(
        bytes(PrivateKey + str(Timestamp) + Nonce, "utf-8"),
        bytes(PublicKey, "utf-8"),
        hashlib.sha256,
    ).hexdigest()
    Headers = {
        "X-tranzila-api-app-key": PublicKey,
        "X-tranzila-api-request-time": str(Timestamp),
        "X-tranzila-api-nonce": Nonce,
        "X-tranzila-api-access-token": AccessKey,
    }
    return Headers



def TranzilaTransactionAPI(EndPoint,Terminal,Body,BaseURL=env("TRANZILA_BASEURL")):
    URL = f"{BaseURL}{EndPoint}"


    PublicKey = env(
        "TRANZILA_ATOK_PUBLIC_KEY"
        if Terminal == "ultranet1atok"
        else "TRANZILA_2P_PUBLIC_KEY"
    )
    PrivateKey = env(
        "TRANZILA_ATOK_PRIVATE_KEY"
        if Terminal == "ultranet1atok"
        else "TRANZILA_2P_PRIVATE_KEY"
    )


   
    Headers = GenerateTranzilaHeaders(PublicKey, PrivateKey)
    Req = requests.post(URL, headers=Headers, verify=False, data=json.dumps(Body))
    print(Req.text)
    Result = json.loads(Req.text)
    print(Result)
    ErrorCode = Result.get("error_code",None)
    ResponseCode =Result.get("transaction_result",{}).get("processor_response_code","000")
    
    if ErrorCode :
       raise Exception(Result["message"])
    
    # if not 000 then there is an error !!! 
    if ResponseCode != "000":
        raise Exception(ErrorResponseCodes[ResponseCode])
    return Result





def GetSTOs(Terminal):
    Body = {
  "terminal_name": Terminal,
  "sto_status": "active",

    }
    
    EndPoint = "/stos/get"
    return TranzilaTransactionAPI(EndPoint,Terminal,Body)


def GetTransactions(Terminal):
    Body= {
                    "terminal_name": Terminal,
                    "transaction_start_date": "2025-01-01",
                    "transaction_end_date": "2025-01-30",
                    "page": 1,
                    "page_results": 10,
                }
    
    BaseURL = "https://report.tranzila.com/v1"
    EndPoint = "/transaction"

    return TranzilaTransactionAPI(EndPoint,Terminal,Body,BaseURL)


    






    












ErrorResponseCodes = {
    "shva": "ממתין לתשובת שב'א",
    "000": "מאושר",
    "777": "פעולה הושלמה (קוד הצלחה לפעולות בהן לא נרשמת עסקה, כוללJ2 ו- J5)",
    "001": "כרטיס חסום",
    "002": "גנוב החרם כרטיס",
    "003": "התקשר לחברת האשראי - מדובר באותם מיקרים שבהם חברת האשראי ברמת מחשב לא יכולה לאשר העסקה. ולכן חברת האשראי מבקשת להתקשר באופן ידני לביצוע בדיקה נוספת מול גורם אנושי כדי לבדוק את האפשרות לקבלת מס' אישור. המפיץ צריך לתת את האפשרות להקלדת מס' אישור באופן ידני. (רצוי לתת פרטים כגון:מס' טלפון של החברה הסולקת, מס' ספק מתאים)",
    "004": "העסקה לא אושרה - סירוב. חשוב לציין שישנם מיקרים בהם בית העסק מתקשר לחברת האשראי ולאחר בדיקה נוספת מול גורם אנושי כן מתקבל מס' אישור. כנ'ל המפיץ צריך לתת את האפשרות להקלדת מס' אישור באופן ידני.",
    "005": "כרטיס מזוייף החרם",
    "006": "דחה עסקה : v2/id שגוי - ת.ז. או VV שגויים",
    "007": "דחה עסקה : avv/uaf שגוי - EI או UAF/AVV שגויים. מדובר בנתונים של עסקה בטוחה . אימות הנתונים מתבצע מול מחשב חברת האשראי . ולכן בירור הנתונים, יתבצע אך ורק מול חברת האשראי.",
    "008": "דחה עסקה avs שגוי",
    "009": "דחייה - נתק בתקשורת -- מסוף לא הצליח להתקשר, התקשר לחברת האשראי",
    "010": "אישור חלקי",
    "011": "דחה עסקה : חוסר בנקודות/כוכבים/מיילים/הטבה אחרת",
    "012": "הכרטיס לא מורשה במסוף - אין אישור מחברת אשראי לעבודה.- מסוף סגור לעבודה לכרטיסי PL )פרטיים( צריך לפנות לחברת האשראי המתאימה.",
    "013": "דחה בקשה. קוד יתרה שגוי",
    "014": "דחייה. כרטיס לא משוייך לרשת",
    "015": "דחה עסקה : הכרטיס אינו בתוקף - פג תוקף. –הוכנס תאריך שלא בתוקף.",
    "016": "דחייה - אין הרשאה לסוג מטבע",
    "017": "דחייה - אין הרשאה לסוג אשראי בעסקה",
    "026": "דחה עסקה - id שגוי - ת.ז. שגויה. האימות מתבצע מול מחשב חברת האשראי . במקרים שיש צורך בבירור נוסף יש לבצע זאת אך ורק מול חברת האשראי.",
    "041": "ישנה חובת יציאה לשאילתא בגין תקרה בלבד לעסקה עם פרמטר J2",
    "042": "ישנה חובת יציאה לשאילתא לא רק בגין תקרה, לעסקה עם פרמטר J2",
    "051": "חסר קובץ ווקטור 1",
    "052": "חסר קובץ ווקטור 4",
    "053": "חסר קובץ ווקטור 6",
    "055": "חסר קובץ ווקטור 11",
    "056": "חסר קובץ ווקטור 12",
    "057": "חסר קובץ ווקטור 15",
    "058": "חסר קובץ ווקטור 18",
    "059": "חסר קובץ ווקטור 31",
    "060": "חסר קובץ ווקטור 34",
    "061": "חסר קובץ ווקטור 41",
    "062": "חסר קובץ ווקטור 44",
    "063": "חסר קובץ ווקטור 64",
    "064": "חסר קובץ ווקטור 80",
    "065": "חסר קובץ ווקטור 81",
    "066": "חסר קובץ ווקטור 82",
    "067": "חסר קובץ ווקטור 83",
    "068": "חסר קובץ ווקטור 90",
    "069": "חסר קובץ ווקטור 91",
    "070": "חסר קובץ ווקטור 92",
    "071": "חסר קובץ ווקטור 93",
    "073": "חסר קובץ PARAM_3_1",
    "074": "חסר קובץ PARAM_3_2",
    "075": "חסר קובץ PARAM_3_3",
    "076": "חסר קובץ PARAM_3_4",
    "077": "חסר קובץ PARAM_361",
    "078": "חסר קובץ PARAM_363",
    "079": "חסר קובץ PARAM_364",
    "080": "חסר קובץ PARAM_61",
    "081": "חסר קובץ PARAM_62",
    "082": "חסר קובץ PARAM_63",
    "083": "חסר קובץ EIL_41",
    "084": "חסר קובץ EIL_42",
    "085": "חסר קובץ EIL_43",
    "086": "חסר קובץ EIL_44",
    "087": "חסר קובץ DATA",
    "088": "חסר קובץ JENR",
    "089": "חבר קובץ Start",
    "101": "חסרה כניסה בוקטור 1",
    "103": "חסרה כניסה בוקטור 4",
    "104": "חסרה כניסה בוקטור 6",
    "106": "חסרה כניסה בוקטור 11",
    "107": "חסרה כניסה בוקטור 12",
    "108": "חסרה כניסה בוקטור 15",
    "110": "חסרה כניסה בוקטור 18",
    "111": "חסרה כניסה בוקטור 31",
    "112": "חסרה כניסה בוקטור 34",
    "113": "חסרה כניסה בוקטור 41",
    "114": "חסרה כניסה בוקטור 44",
    "116": "חסרה כניסה בוקטור 64",
    "117": "חסרה כניסה בוקטור 81",
    "118": "חסרה כניסה בוקטור 82",
    "119": "חסרה כניסה בוקטור 83",
    "120": "חסרה כניסה בוקטור 90",
    "121": "חסרה כניסה בוקטור 91",
    "122": "חסרה כניסה בוקטור 92",
    "123": "חסרה כניסה בוקטור 93",
    "141": "חסרה כניסה מתאימה בקובץ פרמטרים 3.2",
    "142": "חסרה כניסה מתאימה בקובץ פרמטרים 3.3",
    "143": "חסרה כניסה בקובץ תחומי מועדון 3.6.1",
    "144": "חסרה כניסה בקובץ תחומי מועדון 3.6.3",
    "145": "חסרה כניסה בקובץ תחומי מועדון 3.6.4",
    "146": "חסרה כניסה בקובץ תקרות לכרטיסי PL 4.1",
    "147": "חסרה כניסה בקובץ תקרות לכרטיסים ישראלים שאינם PL שיטה 0 4.2",
    "148": "חסרה כניסה בקובץ תקרות לכרטיסים ישראלים שאינם PL שיטה 1 4.3",
    "149": "חסרה כניסה בקובץ תקרות לכרטיסי תייר 4.4",
    "150": "חסרה כניסה בקובץ כרטיסים תקפים - ישראכרט",
    "151": "חסרה כניסה בקובץ כרטיסים תקפים - כאל",
    "152": "חסרה כניסה בקובץ כרטיסים תקפים - מנפיק עתידי",
    "182": "שגיאה בערכי וקטור 4",
    "183": "שגיאה בערכי וקטור 6/12",
    "186": "שגיאה בערכי וקטור 18",
    "187": "שגיאה בערכי וקטור 34",
    "188": "שגיאה בערכי וקטור 64",
    "190": "שגיאה בערכי וקטור 90",
    "191": "נתונים לא תקינים בוקטור הרשאות מנפיק",
    "192": "נתונים לא ולידים בסט הפרמטרים",
    "193": "נתונים לא ולידים בקובץ פרמטרים ברמת מסוף",
    "300": "אין הרשאה לסוג עסקה - הרשאת סולק",
    "301": "אין הרשאה למטבע - הרשאת סולק - אין אישור סולק למטבע ISO. למסוף אין הרשאה מחברת האשראי הסולקת לעסקאות במט'ח.",
    "303": "אין הרשאת סולק לביצוע עסקה כאשר הכרטיס לא נוכח - למסוף אין אישור לעסקה טלפונית.",
    "304": "אין הרשאה לאשראי - הרשאת סולק - כרטיס לא רשאי לבצע במסוף זה או אין אישור לעסקה כזאת.",
    "308": "אין הרשאה להצמדה - הרשאת סולק",
    "309": "אין הרשאה לסולק לאשראי במועד קבוע",
    "310": "אין הרשאה להקלדת מספר אישור מראש",
    "311": "אין הרשאה לבצע עסקאות לקוד שרות 587 - למסוף אין אישור לכרטיס עם קוד השרות 085.",
    "312": "אין הרשאת סולק לאשראי דחוי",
    "313": "אין הרשאת סולק להטבות",
    "314": "אין הרשאת סולק למבצעים",
    "315": "אין הרשאת סולק לקוד מבצע ספציפי",
    "316": "אין הרשאת סולק לעסקת טעינה",
    "317": "אין הרשאת סולק לטעינה/פריקה בקוד אמצעי התשלום בשילוב קוד מטבע",
    "318": "אין הרשאת סולק למטבע בסוג אשראי זה - אין אישור סולק למטבע ISO.",
    "319": "אין הרשאת סולק לטיפ",
    "341": "אין הרשאה לעסקה - הרשאת מנפיק",
    "342": "אין הרשאה למטבע - הרשאת מנפיק - אין אישור למותג למטבע ISO.",
    "343": "אין הרשאת מנפיק לביצוע עסקה כאשר הכרטיס לא נוכח",
    "344": "אין הרשאה לאשראי - הרשאת מנפיק - כרטיס לא רשאי לבצע עסקה עם סוג אשראי זה.",
    "348": "אין הרשאה לביצוע אישור בקשה יזומה ע'י קמעונאי",
    "349": "אין הרשאה מתאימה לביצוע בקשה לאישור ללא עסקה J5",
    "350": "אין הרשאת מנפיק להטבות",
    "351": "אין הרשאת מנפיק לאשראי דחוי",
    "352": "אין הרשאת מנפיק לעסקת טעינה",
    "353": "אין הרשאת מנפיק לטעינה/פריקה בקוד אמצעי התשלום",
    "354": "אין הרשאת מנפיק למטבע בסוג אשראי זה - אין אישור למותג למטבע ISO.",
    "381": "אין הרשאה לבצע עסקת ontatless מעל סכום מרבי",
    "382": "במסוף המוגדר כשרות עצמי ניתן לבצע רק עסקאות בשירות עצמי",
    "384": "מסוף מוגדר כרב-ספק /מוטב - חסר מספר ספק/מוטב",
    "385": "במסוף המוגדר כמסוף סחר אלקטרוני חובה להעביר ei",
    "401": "מספר התשלומים גדול מערך שדה מספר תשלומים מקסימלי",
    "402": "מספר התשלומים קטן מערך שדה מספר תשלומים מינימלי",
    "403": "סכום העסקה קטן מערך שדה סכום מינמלי לתשלום !!!",
    "404": "לא הוזן שדה מספר תשלומים",
    "405": "חסר נתון סכום תשלום ראשון /קבוע",
    "406": "סה'כ סכום העסקה שונה מסכום תשלום ראשון + סכום תשלום קבוע * מספר תשלומים – שגיאה בתשלומים - סכום עסקה צריך להיות שווה תשלום ראשון + )תשלום קבוע כפול מס' תשלומים(- עסקה בתשלומים שהוכנסו ערכים שגויים. פנה למפיץ התוכנה.",
    "407": "ערוץ 2 לא ולידי",
    "408": "ערוץ 2 קצר מ 37-תווים - אורך הפס המגנטי קצר מידי. – הוכנס לקובץ הקלט אורך פס מגנטי לא תקין",
    "410": "דחיה מסיבת dode",
    "414": "בעסקה עם חיוב בתאריך קבוע הוכנס תאריך מאוחר משנה מבצוע העיסקה",
    "415": "הוזנו נתונים לא תקינים",
    "416": "תאריך תוקף לא במבנה תקין",
    "417": "מספר מסוף אינו תקין",
    "418": "חסרים פרמטרים חיוניים",
    "419": "שגיאה בהעברת מאפיין lientInputPan",
    "420": "מספר כרטיס לא ולידי -במצב של הזנת ערוץ 2 בעסקה ללא כרטיס נוכח",
    "421": "שגיאה כללי- נתונים לא ולידים",
    "422": "שגיאה בבנית מסר ISO",
    "424": "שדה לא נומרי",
    "425": "רשומה כפולה",
    "426": "הסכום הוגדל לאחר ביצוע בדיקות אשראית",
    "428": "חסר קוד שרות בכרטיס",
    "429": "כרטיס אינו תקף לפי קובץ כרטיסים תקפים",
    "431": "שגיאה כללית",
    "432": "אין הראשה להעברת כרטיס דרך קורא מגנטי",
    "433": "חיוב להעביר ב - PinPad",
    "434": "אסור להעביר כרטיס במכשיר ה- PinPad",
    "435": "המכשיר לא מוגדר להעברת כרטיס מגנטי TL",
    "436": "המכשיר לא מוגדר להעברת כרטיס EMV TL",
    "439": "אין הרשאה לסוג אשראי לפי סוג עסקה",
    "440": "כרטיס תייר אינו מורשה לסוג אשראי זה",
    "441": "אין הרשאה לביצוע סוג עסקה - כרטיס קיים בוקטור 80",
    "442": "אין לבצע Stand-in לאימות אישור לסולק זה",
    "443": "לא ניתן לבצע עסקת ביטול - כרטיס לא נמצא בקובץ תנועות הקיים במסוף",
    "445": "בכרטיס חיוב מיידי ניתן לבצע אשראי חיוב מיידי בלבד",
    "447": "מספר כרטיס שגוי",
    "448": "חיוב להקליד כתובת לקוח (מיקוד ,מספר בית ועיר)",
    "449": "חיוב להקליד מיקוד",
    "450": "קוד מבצע מחוץ לתחום, צ'ל בתחום 1-12",
    "451": "שגיאה במהלך בנית רשומת עסקה",
    "452": "בעסקה טעינה/פריקה/בירור יתרה חיוב להזין שדה קוד אמצעי תשלום",
    "453": "אין אפשרות לבטל עסקת פריקה 7.9.3",
    "455": "לא ניתן לבצע עסקת חיוב מאולצת כאשר נדרשת בקשה לאישור (למעט תקרות)",
    "456": "כרטיס נמצא בקובץ תנועות עם קוד תשובה 'החרם כרטיס'",
    "457": "בכרטיס חיוב מיידי מותרת עסקת חיוב רגילה/זיכוי/ביטול",
    "458": "קוד מועדון לא בתחום",
    "470": "בעסקת הו'ק סכום התשלומים גבוה משדה סכום העסקה",
    "471": "בעסקת הו'ק מספר תשלום תורן גדול מסה'כ מספר התשלומים",
    "472": "בעסקת חיוב עם מזומן חיוב להזין סכום במזומן",
    "473": "בעסקת חיוב עם מזומן סכום המזומן צריך להיות קטן מסכום העסקה",
    "474": "עסקת איתחול בהוראת קבע מחייבת פרמטר J5",
    "475": "עסקת ה'ק מחייבת אחד מהשדות :מספר תשלומים או סכום כולל",
    "476": "עסקת תורן בהוראת קבע מחייבת שדה מספר תשלום",
    "477": "עסקת תורן בהוראת קבע מחייבת מספר מזהה של עסקת איתחול",
    "478": "עסקת תורן בהוראת קבע מחייבת מספר אישור של עסקת איתחול",
    "479": "עסקת תורן בהוראת קבע מחייבת שדות תאריך וזמן עסקת איתחול",
    "480": "חסר שדה מאשר עסקת מקור",
    "481": "חסר שדה מספר יחידות כאשר העסקה מתבצעת בקוד אמצעי תשלום השונה ממטבע",
    "482": "בכרטיס נטען מותרת עסקת חיוב רגילה/זיכוי/ביטול/פריקה/טעינה/בירור יתרה",
    "483": "עסקה עם כרטיס דלק במסוף דלק חיוב להזין מספר רכב",
    "484": "מספר רכב המוקלד שונה ממספר הרכב הצרוב ע'ג הפס המגנטי/מספר בנק שונה מ-012/ספרות שמאליות של מספר הסניף שונה מ- 44",
    "485": "מספר רכב קצר מ- 6 ספרות /שונה ממספר הרכב המופיע ע'ג ערוץ 2 (פוזיציה 34 בערוץ 2) כרטיס מאפיין דלק של לאומי קארד",
    "486": "ישנה חובת הקלדת קריאת מונה (פוזיציה 30 בערוץ 2) כרטיס מאפיין דלק של לאומי קארד",
    "487": "רק במסוף המוגדר כדלק דו שלבי ניתן להשתמש בעדכון אובליגו",
    "489": "בכרטיס דלקן מותרת עסקת חיוב רגילה בלבד (עסקת ביטול אסורה)",
    "490": "בכרטיסי דלק/דלקן/דלק מועדון ניתן לבצע עסקאות רק במסופי דלק",
    "491": "עסקה הכוללת המרה חייבת להכיל את כל השדות onversion_amount_06, onversion_rate_09, onversion_urreny_51",
    "492": "אין המרה על עסקאות שקל /דולר",
    "493": "בעסקה הכוללת הטבה חיוב שיהיו רק אחד מהשדות הבאים: סכום הנחה/מספר יחידות/ % ההנחה",
    "494": "מספר מסוף שונה",
    "495": "אין הרשאת fallbak",
    "496": "לא ניתן להצמיד אשראי השונה מאשראי קרדיט/תשלומים",
    "497": "לא ניתן להצמיד לדולר/מדד במטבע השונה משקל",
    "498": "כרטיס ישראכרט מקומי הספרטור צ'ל בפוזיציה 18",
    "500": "העסקה הופסקה ע'י המשתמש",
    "504": "חוסר התאמה בין שדה מקור נתוני הכרטיס לשדה מספר כרטיס",
    "505": "ערך לא חוקי בשדה סוג עסקה",
    "506": "ערך לא חוקי בשדה ei",
    "507": "סכום העסקה בפועל גבוה מהסכום המאושר",
    "509": "שגיאה במהלך כתיבה לקובץ תנועות",
    "512": "לא ניתן להכניס אישור שהתקבל ממענה קולי לעסקה זו",
    "551": "מסר תשובה אינו מתאים למסר הבקשה",
    "552": "שגיאה בשדה 55",
    "553": "התקבלה שגיאה מהטנדם",
    "554": "במסר התשובה חסר שדה m_18",
    "555": "במסר התשובה חסר שדה response_ode_25",
    "556": "במסר התשובה חסר שדה rrn_37",
    "557": "במסר התשובה חסר שדה omp_retailer_num_42",
    "558": "במסר התשובה חסר שדה auth_ode_43",
    "559": "במסר התשובה חסר שדה f39_response_39",
    "560": "במסר התשובה חסר שדה authorization_no_38",
    "561": "במסר התשובה חסר / ריק שדה additional_data_48.solek_auth_no",
    "562": "במסר התשובה חסר אחד מהשדות onversion_amount_06, onversion_rate_09, onversion_urreny_51",
    "563": "ערך השדה אינו מתאים למספרי האישור שהתקבלו auth_ode_43",
    "564": "במסר התשובה חסר/ריק שדה additional_amounts54.ashbak_amount",
    "565": "אי-התאמה בין שדה 25 לשדה 43",
    "566": "במסוף המוגדר כתומך בדלק דו-שלבי יש חובה להחזיר שדות 90,119",
    "567": "שדות 25,127 לא תקינים במסר עידכון אובליגו במסוף המוגדר כדלק דו-שלבי",
    "700": "עסקה נדחתה ע'י מכשיר PinPad",
    "701": "שגיאה במכשיר pinpad",
    "702": "יציאת om לא תקינה",
    "703": "עסקה נכשלה",
    "704": "עסקה בוטלה",
    "705": "עסקה הופסקה ע'י המשתמש",
    "706": "זמן המתנה ארוך מדי",
    "707": "משתמש הוציא כרטיס לפני סיום ביצוע העסקה",
    "708": "PINPAD_UserRetriesExeeded",
    "709": "PINPAD_PINPadTimeout",
    "710": "תקלת תקשורת עם מכשיר",
    "711": "PINPAD_PINPadMessageError",
    "712": "PINPAD_PINPadNotInitialized",
    "713": "PINPAD_PINPadardReadError",
    "714": "PINPAD_ReaderTimeout",
    "715": "PINPAD_ReaderommsError",
    "716": "PINPAD_ReaderMessageError",
    "717": "PINPAD_HostMessageError",
    "718": "PINPAD_HostonfigError",
    "719": "PINPAD_HostKeyError",
    "720": "PINPAD_HostonnetError",
    "721": "PINPAD_HostTransmitError",
    "722": "PINPAD_HostReeiveError",
    "723": "PINPAD_HostTimeout",
    "724": "PINVerifiationNotSupportedByard",
    "725": "PINVerifiationFailed",
    "726": "שגיאה בקליטת קובץ onfig.xml",
    "730": "מכשיר אישר עסקה בניגוד להחלטת אשראית",
    "731": "כרטיס לא הוכנס",
    "997": "שגיאה כללית",
    "998": "ERROR_IN_NEG_FILE",
}
